{"chapters": [{"summary": "Hampton founder Sam Parr launches a new podcast for high net worth people. All he asks is if you like it. This podcast is really expensive to make, so he needs you to beg for it. If it's boring, just turn it off.", "gist": "A High-Net Worth Podcast Request", "headline": "Hampton's new podcast is aimed at high net worth people", "start": 250, "end": 64500}, {"summary": "Ankur Nakpal is a friend of mine who in his early thirty s is worth north of $100 million. He shares his exact net worth, his portfolio, how much money he spends each month, where he spends that money and how money has contributed to his happiness. What is his threshold number for when more money stops contributing to general overall happiness?", "gist": "When Is Enough Money Enough to Make You Happy?", "headline": "Is there such thing as having enough money to make you happy", "start": 67510, "end": 157966}, {"summary": "Moneywise is a podcast where we dive into the personal finance and lifestyle changes. In Moneywise, we explore these problems and help you enrich your life beyond the numbers. If you have your act together, more money will equal more happiness.", "gist": "How Much Money Is Enough?", "headline": "Moneywise is the podcast where we dive into the personal finance and lifestyle changes", "start": 158068, "end": 347366}, {"summary": "My goal was to make a million dollars before 21, which I just about managed to hit a few days before my 21st birthday. The biggest thing it gave me was the freedom to just say no to a lot of stuff. $2 million is nice, but it's not really the point where you're secure for the rest of your life.", "gist": "Crossing a Million Dollars at 21", "headline": "Your goal was to make a million dollars before 21", "start": 347468, "end": 491382}, {"summary": "The founder of teachable was looking to build a business. Was doing a little bit of teaching, both in person and online teaching. Eventually raised money and built a company out of it. But it was no intentional grand vision.", "gist": "Startup: Teachable", "headline": "The motivation for starting teachable was looking to build a business", "start": 491516, "end": 552974}, {"summary": "Almost seven years before he sold the company. Do you remember the revenue numbers for each year before you sold it, or the revenue growth trajectory? I always knew when the time came, the company was doing well. And honestly, it worked out.", "gist": "In the Elevator With My Business", "headline": "You ran the company for almost seven years before selling it", "start": 553092, "end": 604350}, {"summary": "When Ocker sold teachable, that couple million dollars that he was living off of suddenly became pocket change. He was able to give some money to his family, including getting his parents a place. Being generous with his family is something that has brought him joy with money.", "gist": "Michael Ocker Selling Teachable For $250 Million", "headline": "Ocker says providing for family brings him happiness with money", "start": 607010, "end": 775780}, {"summary": "The idea isn't exactly how much money will make you happy, but at what point happiness stops growing. Money can increase the power you have of your own life. Ankar spent two years living a bachelor, young, wealthy guy life. Michael has always focused on what makes him happy.", "gist": "How Much Money Will Make You Happy?", "headline": "The idea we're exploring in this podcast is at what point happiness stops growing", "start": 778310, "end": 1060190}, {"summary": "Mike: My cost of living, as in owning this house, are very low. My monthly expenses, again, they're between, based on the monthly. The fact that I don't have to think about it, is what's most valuable.", "gist": "How to Manage Your Money", "headline": "You just basically have property taxes and entertainment expenses per month", "start": 1060340, "end": 1130002}, {"summary": "Can you reveal what your net worth is now and what that portfolio breakdown is? I take about half of it and it just indexes the market just like roughly tracks the s and p. The other half turns out to be my own venture funds.", "gist": "How Much Money Does Your Net Worth Include?", "headline": "Can you reveal what your net worth is now and what that portfolio breakdown is", "start": 1130146, "end": 1188742}, {"summary": "I worry a little about being trapped in a bubble, right. One of the ways I try to sort of force reset a little is super grateful for America. Life has been so good, and you've been just blessed in so many different ways. It'd be real sucks to complain about stuff.", "gist": "Are You Ever Worried About Missing Out on Things?", "headline": "Are you afraid of missing out on certain things because you're in a bubble", "start": 1188876, "end": 1268146}, {"summary": "What amount of money stops contributing to general overall happiness? Anchor: The number we've been looking for is the threshold number. If I were to guess, the number is probably $10 million, maybe a little bit more. Only thing that will change is the number I go to the grave with.", "gist": "Do Million-Dollar Paychecks Reduce Happiness?", "headline": "What amount of money stops contributing to general overall happiness", "start": 1268328, "end": 1356910}, {"summary": " anchor says money is a tool that can bring happiness to us. But that doesn't mean just because we have money, we're going to be happy. Having more money in your bank account does not meaningfully move your baseline sense of well being.", "gist": "Does Rich People Need Money to Be Happy?", "headline": "Having more money does not make a material difference to your general well being", "start": 1359730, "end": 1513854}, {"summary": "Ankar: I would buy a sports team. How much would that cost? The teams in India are so expensive. There's a us cricket league that's getting started. Ankar wants to be part of the draft. Like Mark Cuban of cricket.", "gist": "What Ankar Would Do With His Money", "headline": "Michael Anker says he would buy a sports team with his growing fortune", "start": 1513972, "end": 1591254}, {"summary": "In this episode, we answered the question of the threshold number, which is, at what point will more money not increase happiness? If you want to hear more episodes where we dive deep into the personal finances of high net worth people, tweet at me.", "gist": "What Is My Tension Level?", "headline": "In this episode, we answered the question of the threshold number on happiness", "start": 1591292, "end": 1716010}], "episode_thumbnail": "https://production.listennotes.com/podcasts/new-podcast-trailers/moneywise-E5-8fkz4vN2-bWk7XniDgtx.300x300.jpg", "podcast_title": "New Podcast Trailers", "episode_title": "MoneyWise"}